ucandevices/IO-LINK-Covnerter/firmware/IOLINK_MASTER/IOLINK_MASTER.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
ProjectManager.MainLocation=Core/Src
RCC.MCOFreq_Value=48000000
PB13.GPIOParameters=GPIO_Speed,GPIO_Label
PA6.Mode=Full_Duplex_Master
USB_DEVICE.CLASS_NAME_FS=CDC
PC7.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.USART1Freq_Value=48000000
TIM17.Prescaler=47
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate,WordLength,Parity
VP_TIM17_VS_ClockSourceINT.Mode=Enable_Timer
I2C1.I2C_Speed_Mode=I2C_Fast
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F072RBTx
SPI1.VirtualType=VM_MASTER
NVIC.USB_IRQn=true\:0\:0\:false\:false\:true\:false\:true
USART1.BaudRate=230400
PC10.Locked=true
RCC.PLLCLKFreq_Value=32000000
PC10.Signal=GPIO_Output
PB14.GPIO_Label=UC_T1_ENL
USART1.WordLength=WORDLENGTH_9B
USART2.Parity=PARITY_EVEN
PC7.Locked=true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_SPI1_Init-SPI1-false-HAL-true,4-MX_USART1_UART_Init-USART1-false-HAL-true,5-MX_USART2_UART_Init-USART2-false-HAL-true,6-MX_USART3_UART_Init-USART3-false-HAL-true,7-MX_USART4_UART_Init-USART4-false-HAL-true,8-MX_I2C1_Init-I2C1-false-HAL-true,9-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-false,10-MX_TIM17_Init-TIM17-false-HAL-true,11-MX_TIM7_Init-TIM7-false-HAL-true
PC0.GPIOParameters=GPIO_Speed,GPIO_Label
PC0.GPIO_Label=UC_T3_ENCQ
PC6.GPIO_Label=T0_UC_SIO
PC3.Locked=true
PA11.Mode=Device
PC9.Locked=true
PB0.GPIO_Label=UC_T2_RST
RCC.USART2Freq_Value=48000000
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC5.Mode=Asynchronous
USART1.IPParameters=VirtualMode-Asynchronous,BaudRate,Parity,WordLength
PC1.Locked=true
PB13.GPIO_Label=UC_T1_ENCQ
PB11.Signal=GPIO_Input
PB13.Signal=GPIO_Output
PB15.Signal=GPIO_Input
PC15-OSC32_OUT.GPIO_Label=T3_UC_SIO
PinOutPanel.RotationAngle=0
USART4.Parity=PARITY_EVEN
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_HSI48
ProjectManager.StackSize=0x400
NVIC.I2C1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
USART3.VirtualMode-Asynchronous=VM_ASYNC
VP_TIM7_VS_ClockSourceINT.Mode=Enable_Timer
Mcu.IP4=SYS
RCC.FCLKCortexFreq_Value=48000000
Mcu.IP5=TIM7
I2C1.IPParameters=I2C_Speed_Mode,Timing,Speed
Mcu.IP2=RCC
Mcu.IP3=SPI1
PA15.GPIO_Label=T1_UC_SIO
Mcu.IP0=I2C1
Mcu.IP1=NVIC
PA12.Signal=USB_DP
USART3.BaudRate=230400
Mcu.UserConstants=
PC1.GPIOParameters=PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
PB0.PinState=GPIO_PIN_SET
Mcu.ThirdPartyNb=0
NVIC.USART3_4_IRQn=true\:0\:0\:false\:false\:true\:true\:true
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=48000000
Mcu.IPNb=13
ProjectManager.PreviousToolchain=
PB6.Signal=I2C1_SCL
PC7.Signal=GPIO_Input
PB12.PinState=GPIO_PIN_SET
PB6.Mode=I2C
VP_RCC_USB.Mode=CRS SYNC Source USB
SPI1.CalculateBaudRate=12.0 MBits/s
PC3.Signal=GPIO_Input
PA8.GPIOParameters=PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
Mcu.Pin6=PC3
TIM7.Period=999
Mcu.Pin7=PA0
TIM17.IPParameters=Prescaler
Mcu.Pin8=PA1
Mcu.Pin9=PA2
PC1.PinState=GPIO_PIN_SET
RCC.AHBFreq_Value=48000000
PB13.Locked=true
Mcu.Pin0=PC15-OSC32_OUT
Mcu.Pin1=PF0-OSC_IN
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PF1-OSC_OUT
Mcu.Pin3=PC0
Mcu.Pin4=PC1
Mcu.Pin5=PC2
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=16000000
PB2.Signal=GPIO_Output
PB12.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PA8.Locked=true
PA4.Locked=true
USART2.VirtualMode-Asynchronous=VM_ASYNC
Mcu.IP10=USART4
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=USB_DEVICE
Mcu.IP11=USB
PB12.GPIO_Label=UC_T1_RST
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.2
USART4.IPParameters=VirtualMode-Asynchronous,BaudRate,WordLength,Parity
MxDb.Version=DB.6.0.21
PB0.GPIOParameters=PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
VP_TIM7_VS_ClockSourceINT.Signal=TIM7_VS_ClockSourceINT
USB_DEVICE.USBD_SELF_POWERED=1
ProjectManager.BackupPrevious=false
PB1.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PF0-OSC_IN.Locked=true
PA14.Mode=Serial_Wire
PB1.GPIO_Label=UC_T2_ENCQ
PC11.GPIO_Label=INT_ETH
File.Version=6
PA0.Mode=Asynchronous
PB3.GPIOParameters=GPIO_Label
PB7.Signal=I2C1_SDA
PA8.Signal=GPIO_Output
PA8.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
PB0.Locked=true
ProjectManager.ProjectName=IOLINK_MASTER
PA0.Signal=USART4_TX
RCC.PLLMCOFreq_Value=32000000
PC8.GPIOParameters=GPIO_Speed,GPIO_Label
VP_RCC_USB.Signal=RCC_USB
Mcu.Package=LQFP64
PB9.Signal=GPIO_Output
PB1.Signal=GPIO_Output
PA6.Signal=SPI1_MISO
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
USART3.IPParameters=VirtualMode-Asynchronous,BaudRate,WordLength,Parity
PA10.Signal=USART1_RX
PA15.Signal=GPIO_Input
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
TIM7.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
PC8.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PB14.GPIOParameters=GPIO_Label
USART2.WordLength=WORDLENGTH_9B
RCC.CECFreq_Value=32786.88524590164
RCC.APB1TimFreq_Value=48000000
PB0.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PC5.Signal=USART3_RX
PB10.GPIOParameters=GPIO_Label
USART4.WordLength=WORDLENGTH_9B
PC15-OSC32_OUT.GPIOParameters=GPIO_Label
NVIC.USART1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PF1-OSC_OUT.Mode=HSE-External-Oscillator
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
PA4.GPIO_Label=CS_ETH
PC2.GPIO_Label=UC_T3_ENL
NVIC.TIM7_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.CustomerFirmwarePackage=
PF1-OSC_OUT.Signal=RCC_OSC_OUT
PC4.Mode=Asynchronous
PA8.PinState=GPIO_PIN_SET
PB15.Locked=true
PB3.Locked=true
PA3.Signal=USART2_RX
PA5.Mode=Full_Duplex_Master
PB3.GPIO_Label=L_ON
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
I2C1.Speed=400
RCC.I2SFreq_Value=48000000
ProjectManager.ProjectFileName=IOLINK_MASTER.ioc
PA7.Mode=Full_Duplex_Master
PB9.GPIO_Label=USB_ENABLE
PA10.Mode=Asynchronous
PA15.GPIOParameters=GPIO_Label
PC10.GPIO_Label=RST_ETH
Mcu.PinsNb=49
PC9.GPIO_Label=UC_T0_ENL
ProjectManager.NoMain=false
PC11.Locked=true
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
USB_DEVICE.VirtualModeFS=Cdc_FS
PC11.Signal=GPIO_Input
PC8.Signal=GPIO_Output
PC2.Signal=GPIO_Output
PC4.Signal=USART3_TX
PC6.Signal=GPIO_Input
PB11.GPIO_Label=T2_UC_SIO
ProjectManager.DefaultFWLocation=true
PB12.Locked=true
ProjectManager.DeletePrevious=true
PF1-OSC_OUT.Locked=true
PC0.Signal=GPIO_Output
PB14.Locked=true
PB10.Locked=true
PC11.GPIOParameters=GPIO_Label
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS,USBD_SELF_POWERED
VP_TIM17_VS_ClockSourceINT.Signal=TIM17_VS_ClockSourceINT
NVIC.USART2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
USART2.BaudRate=230400
RCC.FamilyName=M
PB9.GPIOParameters=GPIO_Label
PC3.GPIOParameters=GPIO_Label
PC8.GPIO_Label=UC_T0_ENCQ
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA3.Mode=Asynchronous
PA13.Signal=SYS_SWDIO
PA9.Mode=Asynchronous
PA15.Locked=true
PC0.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PA8.GPIO_Label=UC_T0_RST
PC15-OSC32_OUT.Locked=true
ProjectManager.TargetToolchain=STM32CubeIDE
PB10.GPIO_Label=T2_UC_IRQ
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
PC6.Locked=true
PB2.GPIOParameters=GPIO_Label
PA9.Signal=USART1_TX
USART1.Parity=PARITY_EVEN
I2C1.Timing=0x0000020B
PB13.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PB11.GPIOParameters=GPIO_Label
PB9.Locked=true
PC2.Locked=true
ProjectManager.RegisterCallBack=
PC7.GPIO_PuPd=GPIO_NOPULL
PC15-OSC32_OUT.Signal=GPIO_Input
PA1.Signal=USART4_RX
Mcu.Pin48=VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS
PB1.Locked=true
Mcu.Pin46=VP_TIM7_VS_ClockSourceINT
PF0-OSC_IN.Mode=HSE-External-Oscillator
Mcu.Pin47=VP_TIM17_VS_ClockSourceINT
PB10.Signal=GPIO_Input
PB14.Signal=GPIO_Output
PA5.Signal=SPI1_SCK
Mcu.Pin40=PB3
Mcu.Pin41=PB6
Mcu.Pin44=VP_RCC_USB
USART4.VirtualMode-Asynchronous=VM_ASYNC
Mcu.Pin45=VP_SYS_VS_Systick
Mcu.Pin42=PB7
TIM7.Prescaler=47
board=custom
Mcu.Pin43=PB9
ProjectManager.LastFirmware=true
USART4.BaudRate=230400
USART3.WordLength=WORDLENGTH_9B
RCC.VCOOutput2Freq_Value=16000000
PA1.Mode=Asynchronous
TIM7.IPParameters=Prescaler,AutoReloadPreload,Period
MxCube.Version=6.2.1
Mcu.Pin37=PA15
Mcu.Pin38=PC10
PB15.GPIO_Label=T1_UC_IRQ
Mcu.Pin35=PA13
Mcu.Pin36=PA14
SPI1.Mode=SPI_MODE_MASTER
Mcu.Pin39=PC11
PC2.GPIOParameters=GPIO_Label
Mcu.Pin30=PA8
PC1.GPIO_Label=UC_T3_RST
VP_SYS_VS_Systick.Mode=SysTick
Mcu.Pin33=PA11
Mcu.Pin34=PA12
Mcu.Pin31=PA9
Mcu.Pin32=PA10
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PC10.GPIOParameters=GPIO_Label
PB15.GPIOParameters=GPIO_Label
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,CECFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSICECFreq_Value,I2SFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLSourceVirtual,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USART1Freq_Value,USART2Freq_Value,VCOOutput2Freq_Value
PC9.GPIOParameters=GPIO_Label
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F072R(8-B)Tx
Mcu.Pin26=PC6
Mcu.Pin27=PC7
PA2.Signal=USART2_TX
Mcu.Pin24=PB14
ProjectManager.UnderRoot=true
Mcu.Pin25=PB15
PB2.Locked=true
Mcu.IP8=USART2
RCC.HSICECFreq_Value=32786.88524590164
Mcu.IP9=USART3
PC7.GPIO_Label=T0_UC_IRQ
Mcu.Pin28=PC8
Mcu.IP6=TIM17
Mcu.Pin29=PC9
Mcu.IP7=USART1
ProjectManager.CoupleFile=true
PB3.Signal=GPIO_Output
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=48000000
Mcu.Pin22=PB12
Mcu.Pin23=PB13
RCC.TimSysFreq_Value=48000000
Mcu.Pin20=PB10
Mcu.Pin21=PB11
PA12.Mode=Device
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_DM
PB7.Mode=I2C
PA14.Signal=SYS_SWCLK
PB2.GPIO_Label=UC_T2_ENL
ProjectManager.HeapSize=0x200
Mcu.Pin15=PC4
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PC5
Mcu.Pin13=PA6
PC6.GPIOParameters=GPIO_Label
Mcu.Pin14=PA7
Mcu.Pin19=PB2
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB0
Mcu.Pin18=PB1
PC1.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
Mcu.Pin11=PA4
Mcu.Pin12=PA5
Mcu.Pin10=PA3
PA2.Mode=Asynchronous
PC3.GPIO_Label=T3_UC_IRQ
PC8.Locked=true
PC9.Signal=GPIO_Output
PF0-OSC_IN.Signal=RCC_OSC_IN
RCC.APB1Freq_Value=48000000
PB0.Signal=GPIO_Output
USB_DEVICE.VirtualMode=Cdc
PC0.Locked=true
PB11.Locked=true
ProjectManager.DeviceId=STM32F072RBTx
PC1.Signal=GPIO_Output
PB12.GPIOParameters=PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
PB1.GPIOParameters=GPIO_Speed,GPIO_Label
PA7.Signal=SPI1_MOSI
USART3.Parity=PARITY_EVEN
isbadioc=false
